testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000____delay-ms_0____loss-rate-percent_0.0001____clients-requests_10/2/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 66.67ms, 149.99 req/s, 143.09MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.54MB (10003820) total, 120B (120) headers (space savings 87.23%), 9.54MB (10000000) data
UDP datagram: 611 sent, 8243 received
                     min         max         mean         sd        +/- sd
time for request:    39.85ms     59.66ms     49.99ms      6.76ms    60.00%
time for connect:     4.07ms     25.64ms     14.69ms      7.29ms    60.00%
time to 1st byte:    25.33ms     28.26ms     26.74ms      1.13ms    70.00%
req/s           :      15.09       15.68       15.38        0.21    60.00%